Repository: jorgednts/companies-app
Catalog: lib/l10n/intl_*.arb
Languages: es

# loginScreenWelcomeText
source: Welcome to companies
es: Bienvenidos a empresas

# loginScreenFormPasswordLabelText
source: Password
es: Contraseña

# loginScreenButtonText
source: Sing in
es: Iniciar sesión

# loginScreenFormInvalidEmail
source: Enter a valid email address. Ex: abc@abc.com.br
es: Introduzca una dirección de correo electrónico válida. Ej: abc@abc.com.br

# loginScreenEmptyFormText
source: Fill the field
es: Completar el campo

# loginScreenFormInvalidPassword
source: Password must contain at least 8 characters
es: La contraseña debe contener al menos 8 caracteres

# messageNetworkError
source: Connection fail. Try again
es: Conexión fallida. Inténtalo de nuevo

# messageGenericError
source: Occurred error. Try again
es: Ocurrio un error. Inténtalo de nuevo

# messageUnauthorizedAuth
source: Invalid credentials. Try again
es: Credenciales no válidas. Inténtalo de nuevo

# mainScreenNoEnterpriseResult
source: No companies were found for a search performed.
es: No se encontraron empresas para una búsqueda realizada.

# mainScreenHintTextAppBar
source: Search
es: Buscar

# mainScreenInitialStateMessage
source: Click on search to start
es: Haga clic en buscar para comenzar

# loadingAppBarTitle
source: Loading...
es: Cargando...
